Paciente8159/uCNC/uCNC/src/hal/mcus/esp8266/mcumap_esp8266.h
// Hardware I2C not supported

// #if (defined(I2C_CLK) && defined(I2C_DATA))
// #define MCU_HAS_I2C
// #ifndef I2C_PORT
// #define I2C_PORT 0
// #endif
// #ifndef I2C_FREQ
// #define I2C_FREQ 400000UL
// #endif
// #endif

// Helper macros
#define __helper_ex__(left, mid, right) (left##mid##right)
#define __helper__(left, mid, right) (__helper_ex__(left, mid, right))
#ifndef __indirect__
#define __indirect__ex__(X, Y) DIO##X##_##Y
#define __indirect__(X, Y) __indirect__ex__(X, Y)
#endif

#ifndef BYTE_OPS
#define BYTE_OPS
#define SETBIT(x, y) ((x) |= (1U << (y)))    /* Set bit y in byte x*/
#define CLEARBIT(x, y) ((x) &= ~(1U << (y))) /* Clear bit y in byte x*/
#define CHECKBIT(x, y) ((x) & (1U << (y)))   /* Check bit y in byte x*/
#define TOGGLEBIT(x, y) ((x) ^= (1U << (y))) /* Toggle bit y in byte x*/

#define SETFLAG(x, y) ((x) |= (y))    /* Set byte y in byte x*/
#define CLEARFLAG(x, y) ((x) &= ~(y)) /* Clear byte y in byte x*/
#define CHECKFLAG(x, y) ((x) & (y))   /* Check byte y in byte x*/
#define TOGGLEFLAG(x, y) ((x) ^= (y)) /* Toggle byte y in byte x*/
#endif

#define MCU_HAS_SOFT_PWM_TIMER
extern uint8_t g_io_soft_pwm[16];
extern uint8_t g_soft_pwm_res;
#define mcu_set_pwm(X, Y) ({ g_io_soft_pwm[X - PWM_PINS_OFFSET] = (0xFF & Y); })
#define mcu_get_pwm(X) g_io_soft_pwm[X - PWM_PINS_OFFSET]

#define mcu_config_input(X)                                                    \
  if (__indirect__(X, BIT) < 16) {                                             \
    GPF(__indirect__(X, BIT)) = GPFFS(GPFFS_GPIO(__indirect__(X, BIT)));       \
    GPEC = (1 << __indirect__(X, BIT));                                        \
    GPC(__indirect__(X, BIT)) =                                                \
        (GPC(__indirect__(X, BIT)) & (0xF << GPCI)) | (1 << GPCD);             \
  }                                                                            \
  if (__indirect__(X, BIT) == 16) {                                            \
    GPF16 = GP16FFS(GPFFS_GPIO(16));                                           \
    GPC16 = 0;                                                                 \
    GP16E &= ~1;                                                               \
  }

#define mcu_config_pullup(X)                                                   \
  if (__indirect__(X, BIT) < 16) {                                             \
    GPF(__indirect__(X, BIT)) |= (1 << GPFPU);                                 \
  }

#define mcu_config_output(X)                                                   \
  if (__indirect__(X, BIT) < 16) {                                             \
    GPF(__indirect__(X, BIT)) = GPFFS(GPFFS_GPIO(__indirect__(X, BIT)));       \
    GPC(__indirect__(X, BIT)) = (GPC(__indirect__(X, BIT)) & (0xF << GPCI));   \
    GPES = (1 << __indirect__(X, BIT));                                        \
  }                                                                            \
  if (__indirect__(X, BIT) == 16) {                                            \
    GPF16 = GP16FFS(GPFFS_GPIO(16));                                           \
    GPC16 = 0;                                                                 \
    GP16E |= 1;                                                                \
  }

#define mcu_config_output_od(X)                                                \
  if (__indirect__(X, BIT) < 16) {                                             \
    GPIEC = (1 << __indirect__(X, BIT));                                       \
    GPC(__indirect__(X, BIT)) |= (1 << GPCD);                                  \
    GPES = (1 << __indirect__(X, BIT));                                        \
  }

#define mcu_config_af(X, FUNC)                                                 \
  {                                                                            \
    GPIEC = (1 << __indirect__(X, BIT));                                       \
    GPF(__indirect__(X, BIT)) = GPFFS(GPFFS_BUS(__indirect__(X, BIT)));        \
    GPES = (1 << __indirect__(X, BIT));                                        \
    switch (FUNC) {                                                            \
    case SPECIAL:                                                              \
      if (__indirect__(X, BIT) == 3) {                                         \
        GPF(__indirect__(X, BIT)) |= (1 << GPFPU);                             \
      }                                                                        \
      break;                                                                   \
    default:                                                                   \
      GPF(__indirect__(X, BIT)) = GPFFS((FUNC >> 4) & 0x07);                   \
      if (__indirect__(X, BIT) == 13 && FUNC == FUNCTION_4)                    \
        GPF(__indirect__(X, BIT)) |= (1 << GPFPU);                             \
      break;                                                                   \
    }                                                                          \
  }

typedef struct signal_timer_ {
  uint32_t current_us;
  uint8_t us_step;
  uint32_t itp_reload;
  bool step_alarm_en;
  uint32_t pwm_reload;
} signal_timer_t;

extern signal_timer_t signal_timer;
#define mcu_softpwm_freq_config(pin, freq)                                     \
  ({                                                                           \
    mcu_config_output(pin);                                                    \
    signal_timer.pwm_reload = (uint32_t)(1000000 / freq);                      \
  })

#define mcu_config_pwm(X, freq) mcu_softpwm_freq_config(X, freq)

#define mcu_config_analog(X) mcu_config_input(X)

#define mcu_config_input_isr(X)                                                \
  attachInterrupt(digitalPinToInterrupt(__indirect__(X, BIT)),                 \
                  __indirect__(X, ISRCALLBACK), CHANGE)

#define mcu_get_input(X)                                                       \
  ((__indirect__(X, BIT) < 16) ? GPIP(__indirect__(X, BIT)) : (GP16I & 0x01))

/**
 * Due to the way this core works this has some special calls to make direct
 * output pin calls
 */
#define mcu_get_output_gpio(X)                                                 \
  ((__indirect__(X, BIT) == 16) ? CHECKBIT(GP16O, 1)                           \
                                : CHECKBIT(GPO, __indirect__(X, BIT)))
#define mcu_set_output_gpio(X)                                                 \
  ({                                                                           \
    if (__indirect__(X, BIT) == 16) {                                          \
      SETBIT(GP16O, 1);                                                        \
    } else {                                                                   \
      GPOS = (1 << __indirect__(X, BIT));                                      \
    }                                                                          \
  })
#define mcu_clear_output_gpio(X)                                               \
  ({                                                                           \
    if (__indirect__(X, BIT) == 16) {                                          \
      CLEARBIT(GP16O, 1);                                                      \
    } else {                                                                   \
      GPOC = (1 << __indirect__(X, BIT));                                      \
    }                                                                          \
  })
#define mcu_toggle_output_gpio(X)                                              \
  ({                                                                           \
    if (__indirect__(X, BIT) == 16) {                                          \
      TOGGLEBIT(GP16O, 1);                                                     \
    } else {                                                                   \
      TOGGLEBIT(GPO, __indirect__(X, BIT));                                    \
    }                                                                          \
  })

extern volatile uint32_t esp8266_io_out;
#define mcu_get_output(X)                                                      \
  ((X < 200) ? CHECKBIT(esp8266_io_out, __indirect__(X, BIT))                  \
             : mcu_get_output_gpio(X))
#define mcu_set_output(X)                                                      \
  ({                                                                           \
    if (X < 200) {                                                             \
      SETBIT(esp8266_io_out, __indirect__(X, BIT));                            \
    } else {                                                                   \
      mcu_set_output_gpio(X);                                                  \
    }                                                                          \
  })
#define mcu_clear_output(X)                                                    \
  ({                                                                           \
    if (X < 200) {                                                             \
      CLEARBIT(esp8266_io_out, __indirect__(X, BIT));                          \
    } else {                                                                   \
      mcu_clear_output_gpio(X);                                                \
    }                                                                          \
  })
#define mcu_toggle_output(X)                                                   \
  ({                                                                           \
    if (X < 200) {                                                             \
      TOGGLEBIT(esp8266_io_out, __indirect__(X, BIT));                         \
    } else {                                                                   \
      mcu_toggle_output_gpio(X);                                               \
    }                                                                          \
  })

