Paciente8159/uCNC/uCNC/src/hal/mcus/esp8266/mcumap_esp8266.h
#define mcu_get_analog(X)                                                      \
  if (__indirect__(X, BIT) == 17 || __indirect__(X, BIT) == 0) {               \
    return system_adc_read();                                                  \
  } else {                                                                     \
    return (mcu_get_input()) ? 1023 : 0;                                       \
  }

// ISR
// #include <xtensa/corebits.h>
#define mcu_enable_global_isr() xt_rsil(0)
#define mcu_disable_global_isr() xt_rsil(15)
#ifndef PS_INTLEVEL_MASK
#define PS_INTLEVEL_MASK 0x0000000F
#endif
#ifndef PS_EXCM_MASK
#define PS_EXCM_MASK 0x00000010
#endif
#define mcu_get_global_isr()                                                   \
  ({                                                                           \
    uint32_t ps;                                                               \
    __asm__ __volatile__("rsr.ps %0" : "=r"(ps));                              \
    ((ps & PS_INTLEVEL_MASK) == 0);                                            \
  })
#define mcu_in_isr_context()                                                   \
  ({                                                                           \
    uint32_t ps;                                                               \
    __asm__ __volatile__("rsr.ps %0" : "=r"(ps));                              \
    ((ps & PS_EXCM_MASK) == 0);                                                \
  })

#if IC74HC595_COUNT > 0

#if IC74HC595_COUNT > 4
#error                                                                         \
    "Maximum allowed IC74HC595_COUNT is 4 with SHIFT_REGISTER_CUSTOM_CALLBACK"
#endif

// custom pin operations for 74HS595
extern volatile uint32_t ic74hc595_io_out;
#ifdef SHIFT_REGISTER_CUSTOM_CALLBACK
// reverses bytes
#define ic74hc595_pin_offset(pin)                                              \
  (((IC74HC595_COUNT - 1 - (__indirect__(pin, IO_OFFSET) >> 3)) << 3) |        \
   (__indirect__(pin, IO_OFFSET) & 0x7))
#else
#define io_extended_pins_update()
#define ic74hc595_pin_offset(pin) (__indirect__(pin, IO_OFFSET))
#endif
#define ic74hc595_pin_mask(pin) (uint32_t)(1UL << ic74hc595_pin_offset(pin))
#define ic74hc595_set_pin(pin)                                                 \
  SETBIT(ic74hc595_io_out, ic74hc595_pin_offset(pin))
#define ic74hc595_clear_pin(pin)                                               \
  CLEARBIT(ic74hc595_io_out, ic74hc595_pin_offset(pin))
#define ic74hc595_toggle_pin(pin)                                              \
  TOGGLEBIT(ic74hc595_io_out, ic74hc595_pin_offset(pin))
#define ic74hc595_get_pin(pin)                                                 \
  CHECKBIT(ic74hc595_io_out, ic74hc595_pin_offset(pin))

#endif

#ifdef __cplusplus
}
#endif

#endif
